pkg/soap/request.template.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <checkVat xmlns="urn:ec.europa.eu:taxud:vies:services:checkVat:types">
            <countryCode>DE</countryCode>
            <vatNumber>{{ .VATNumber }}</vatNumber>
        </checkVat>
  </soap:Body>
</soap:Envelope>